Revit 2026 API

# SegmentDescription Property

---

The description of the segment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Description { get; set; }
```
```vb
Public Property Description As String
	Get
	Set
```
```cpp
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Description : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Segment Class

Autodesk.Revit.DB Namespace